#Здесь будут находиться словари с лексиконом бота
LEXICON = {
    'greeting': '''Привет, это <b>FPL бот</b> для комфортной и качественной игры в полигон страйк. Здесь вы сможете поднимать уровень своей игры, входить в топ рейтинга лучших игроков и получать призы.''',
    'requests_nick': 'Введите ваш никнейм:\n\nЕго длина должна составлять не более 32 символов',
    'requests_new_password': '''Придумайте пароль.\n
1. Должен быть длиной не менее 8 символов.
2. Должен включать в себя хотя бы одну цифру.
3. Должен содержать хотя бы одну заглавную букву.
4. Все буквы, которые есть в вашем пароле, должны принадлежать английскому алфавиту.''',
    'not_enough_len': 'Длина должна быть >= 8 символов.',
    'not_enough_up': 'В пароле должна быть хотя бы 1 заглавная буква.',
    'valid_password': 'Отлично! Теперь повторите пароль.',
    'password_confirmed': 'Регистрация прошла успешно! Приятной игры!',
    'password_not_confired': 'Неверный пароль, попробуйте еще раз.',
    'no_nums': 'Пароль должен содержать хотя бы одну цифру.',
    'no_english': 'Пароль должен содержать буквы и только английсские.',
    'requests_email': 'Введите вашу электронную почту:',
    'confirmation_code_sent': 'На вашу почту выслан код подтверждения, отправьте его в чат',
    'false_code': 'Неверный код',
    'email_confirmed': 'Почта подтверждена',
    'main_menu': 'Вы находитесь в главном меню',
    'find_game': 'Подключение к лобби...',
    'in_lobby': 'Вы находитесь в лобби, ожидайте остальных игроков',
    'to_long_pass': 'Слишком длинный пароль',
    'to_long_nick': 'Слишком длинный никнейм'
}

reply_btn_lex = {
    'play': 'Играть',
    'profile': 'Профиль',
    'search_teammates': 'Поиск тимметов',
    'clans': 'Кланы',
    'tournamets': 'Турниры',
    'shop': 'Магазин',
    'workout': 'Тренировки',
    'rating': 'Рейтинг'
}